# <center>MovieLens 1M数据集</center>

# 数据内容
MviesLens 1M数据集含有来自6000多名用户对4000部电影的100万条评分数据。它分为三个表：评分(ratings.dat)、用户信息(users.dat)和电影信息(movies.dat)。

# 目标
使用pandas对json格式的文本进行数据分析(统计、排序)。并结合matplotlib绘图库来进行数据的展示

## 0.准备工作

In [1]:
%pwd

u'D:\\GitClone\\kayle_Note\\Data Analysis\\chapter02\\code'

In [2]:
%cd ../data/movielens

D:\GitClone\kayle_Note\Data Analysis\chapter02\data\movielens

### 设置工作路径

目标文件是三个表：评分(ratings.dat)、用户信息(users.dat)和电影信息(movies.dat)

In [3]:
rating_path = 'ratings.dat'
user_path = 'users.dat'
movie_path = 'movies.dat'

In [6]:
import pandas as pd

# 用户信息表中的内容 
unames = ['user_id', 'gender', 'age', 'occupation', 'zip']
# sep='::' 表示分隔符
users = pd.read_table(user_path, sep='::', header=None, names=unames)

# 评分表中的内容
rnames = ['user_id', 'movie_id', 'rating', 'timestamp']
ratings = pd.read_table(rating_path, sep='::', header=None, names=rnames)

# 电影信息表中的内容
mnames = ['movie_id', 'title', 'genres']
movies = pd.read_table(movie_path, sep='::', header=None, names=mnames)

C:\Anaconda3\envs\python2\lib\site-packages\ipykernel_launcher.py:6: FutureWarning: read_table is deprecated, use read_csv instead.

C:\Anaconda3\envs\python2\lib\site-packages\ipykernel_launcher.py:6: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.

C:\Anaconda3\envs\python2\lib\site-packages\ipykernel_launcher.py:10: FutureWarning: read_table is deprecated, use read_csv instead.
  # Remove the CWD from sys.path while we load stuff.
C:\Anaconda3\envs\python2\lib\site-packages\ipykernel_launcher.py:10: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  # Remove the CWD from sys.path while we load stuff.
C:\Anaconda3\envs\python2\lib\site-packages\ipykernel_launcher.py:14: FutureWarning: read_table is deprecated, use read_csv instead.

C:\Anaconda3\envs\python2\lib\site-packages\ipykernel_launcher.py:14: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.

In [5]:
users[:5]

   user_id gender  age  occupation    zip
0        1      F    1          10  48067
1        2      M   56          16  70072
2        3      M   25          15  55117
3        4      M   45           7  02460
4        5      M   25          20  55455

In [7]:
ratings[:5]

   user_id  movie_id  rating  timestamp
0        1      1193       5  978300760
1        1       661       3  978302109
2        1       914       3  978301968
3        1      3408       4  978300275
4        1      2355       5  978824291

In [8]:
movies[:5]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy